# Pandas Notebook 3

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv("../employee_dataset.csv")
data.head()

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
1,Julie Morton,Nichols-James,Diplomatic Services operational officer,North Melissafurt,Marshall Islands,589090,Full Time,4.3
2,Matthew Hall,Scott Inc,Regulatory affairs officer,Wardfort,Anguilla,630890,Full Time,3.1
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
4,Theresa Owens,"Baker, Allen and Edwards",Production engineer,Whiteside,Dominica,523499,Full Time,4.8

### 91. What is the ratio of total full-time employees to Interns?

In [11]:
total_full_time = (data['Employment_Status'] == 'Full Time').sum()
total_interns = (data['Employment_Status'] == 'Intern').sum()
total_full_time/total_interns

4.0008334722453744

### 92. Starting from the first record, print every third record in the DataFrame.

Print 1st row, then 4th, 7th, 10th, and so on...

In [18]:
data.iloc[0::3]

,Name,Company_Name,Employee_Job_Title,Employee_City,Employee_Country,Employee_Salary,Employment_Status,Employee_Rating
0,Spencer Adkins,James and Sons,Equities trader,New Russellton,Palestinian Territory,321520,Full Time,3.9
3,Brad Scott,"Johnston, Fleming and Tanner",Production engineer,West Jamesview,Syrian Arab Republic,116400,Full Time,3.1
6,Kelly Brown,Andrade LLC,Naval architect,Wardfort,Aruba,711410,Full Time,2.0
9,Michael Edwards,"Campos, Reynolds and Mccormick",Ergonomist,New Cindychester,Lao People's Democratic Republic,516950,Full Time,2.3
12,Tiffany Galvan,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,West Jamesview,Niger,786430,Intern,3.6
...,...,...,...,...,...,...,...,...
299985,Chase Stevens,Nelson-Li,Energy manager,Whitakerbury,Northern Mariana Islands,590590,Full Time,2.6
299988,Kenneth Hurley,Scott Inc,Make,New Russellton,Russian Federation,211180,Full Time,3.9
299991,William Rodriguez,Scott Inc,Ergonomist,Whiteside,New Zealand,214400,Full Time,1.5
299994,Kelly Bennett,"White, Mcclain and Cobb","Radiographer, therapeutic",Wardfort,Fiji,182270,Full Time,3.6
299997,Lynn Wilson,Nichols-James,Administrator,New Cindychester,Bolivia,802830,Full Time,0.6

### 93. Find the average salary for every company.

In [7]:
data.groupby('Company_Name')['Employee_Salary'].mean()

Company_Name
Andrade LLC                       497237.159385
Baker, Allen and Edwards          498032.358445
Bullock-Carrillo                  499603.804865
Campos, Reynolds and Mccormick    503528.982687
James and Sons                    503581.015754
Johnston, Fleming and Tanner      500579.128010
Marshall-Holloway                 502314.169445
Matthews Inc                      501640.159488
Nelson-Li                         500569.824558
Nichols-James                     497881.232334
Scott Inc                         500491.809024
Taylor-Ramos                      498747.292516
Thomas-Spencer                    499350.850164
Wallace, Smith and Shepard        500807.608810
White, Mcclain and Cobb           499083.493806
Name: Employee_Salary, dtype: float64

### 94. Find the average rating for every company.

In [8]:
data.groupby('Company_Name')['Employee_Rating'].mean()

Company_Name
Andrade LLC                       2.498218
Baker, Allen and Edwards          2.504795
Bullock-Carrillo                  2.502014
Campos, Reynolds and Mccormick    2.506288
James and Sons                    2.505023
Johnston, Fleming and Tanner      2.513159
Marshall-Holloway                 2.504900
Matthews Inc                      2.525454
Nelson-Li                         2.504649
Nichols-James                     2.488554
Scott Inc                         2.515993
Taylor-Ramos                      2.513150
Thomas-Spencer                    2.505114
Wallace, Smith and Shepard        2.497402
White, Mcclain and Cobb           2.504047
Name: Employee_Rating, dtype: float64

### 95. Find the average salary and average rating for every company in a single line.

In [32]:
data.groupby('Company_Name')[['Employee_Salary', 'Employee_Rating']].mean()

                                Employee_Salary  Employee_Rating
Company_Name
Andrade LLC                       497237.159385         2.498218
Baker, Allen and Edwards          498032.358445         2.504795
Bullock-Carrillo                  499603.804865         2.502014
Campos, Reynolds and Mccormick    503528.982687         2.506288
James and Sons                    503581.015754         2.505023
Johnston, Fleming and Tanner      500579.128010         2.513159
Marshall-Holloway                 502314.169445         2.504900
Matthews Inc                      501640.159488         2.525454
Nelson-Li                         500569.824558         2.504649
Nichols-James                     497881.232334         2.488554
Scott Inc                         500491.809024         2.515993
Taylor-Ramos                      498747.292516         2.513150
Thomas-Spencer                    499350.850164         2.505114
Wallace, Smith and Shepard        500807.608810         2.497402
White, Mcclain and Cobb           499083.493806         2.504047


### 96. Find the number of unique Employee_City corresponding to every Company_Name.

In [30]:
data.groupby('Company_Name')['Employee_City'].nunique().reset_index()

                      Company_Name  Employee_City
0                      Andrade LLC             10
1         Baker, Allen and Edwards             10
2                 Bullock-Carrillo             10
3   Campos, Reynolds and Mccormick             10
4                   James and Sons             10
5     Johnston, Fleming and Tanner             10
6                Marshall-Holloway             10
7                     Matthews Inc             10
8                        Nelson-Li             10
9                    Nichols-James             10
10                       Scott Inc             10
11                    Taylor-Ramos             10
12                  Thomas-Spencer             10
13      Wallace, Smith and Shepard             10
14         White, Mcclain and Cobb             10

### 98. Print the number of full-time and intern employees for every company

In [49]:
data.groupby(['Company_Name', 'Employment_Status']).size().reset_index(name = 'Count')

                      Company_Name Employment_Status  Count
0                      Andrade LLC         Full Time  15964
1                      Andrade LLC            Intern   4019
2         Baker, Allen and Edwards         Full Time  16118
3         Baker, Allen and Edwards            Intern   3966
4                 Bullock-Carrillo         Full Time  16135
5                 Bullock-Carrillo            Intern   3928
6   Campos, Reynolds and Mccormick         Full Time  15930
7   Campos, Reynolds and Mccormick            Intern   3997
8                   James and Sons         Full Time  15888
9                   James and Sons            Intern   3980
10    Johnston, Fleming and Tanner         Full Time  15832
11    Johnston, Fleming and Tanner            Intern   3979
12               Marshall-Holloway         Full Time  15871
13               Marshall-Holloway            Intern   3988
14                    Matthews Inc         Full Time  16082
15                    Matthews Inc            Intern   4001
16                       Nelson-Li         Full Time  16027
17                       Nelson-Li            Intern   4105
18                   Nichols-James         Full Time  15872
19                   Nichols-James            Intern   4039
20                       Scott Inc         Full Time  16396
21                       Scott Inc            Intern   3994
22                    Taylor-Ramos         Full Time  16086
23                    Taylor-Ramos            Intern   4036
24                  Thomas-Spencer         Full Time  16037
25                  Thomas-Spencer            Intern   4105
26      Wallace, Smith and Shepard         Full Time  15467
27      Wallace, Smith and Shepard            Intern   3897
28         White, Mcclain and Cobb         Full Time  16305
29         White, Mcclain and Cobb            Intern   3956

### 99. Print the job title with the most employees.

In [54]:
employee_counts = data.groupby('Employee_Job_Title')['Name'].nunique().reset_index(name = 'Employees')
employee_counts.sort_values(by = 'Employees', ascending = False)

                                   Employee_Job_Title  Employees
3             Diplomatic Services operational officer      25437
7                        Garment/textile technologist      13807
1                                       Administrator      13790
18                          Trading standards officer      13755
12                                    Patent examiner      13721
2   Armed forces logistics/support/administrative ...      13648
16                                Retail merchandiser      13643
0                                             Actuary      13638
6                                          Ergonomist      13628
4                                      Energy manager      13626
13                                Production engineer      13620
5                                     Equities trader      13611
8                        Investment banker, corporate      13607
15                         Regulatory affairs officer      13521
10                                    Naval architect      13510
11                                        Optometrist      13489
14                          Radiographer, therapeutic      13476
17                  Sales promotion account executive      13451
9                                                Make      13357

### 100. Print the job title with the most employees corresponding to every company.

In [65]:
employee_counts = data.groupby(['Company_Name', 'Employee_Job_Title'])['Name'].nunique().reset_index(name = 'Employees')
employee_counts_sorted = employee_counts.sort_values(['Company_Name', 'Employees'], ascending = [True, False])
employee_counts_sorted.drop_duplicates('Company_Name', keep = 'first')

,Company_Name,Employee_Job_Title,Employees
3,Andrade LLC,Diplomatic Services operational officer,1988
22,"Baker, Allen and Edwards",Diplomatic Services operational officer,1957
41,Bullock-Carrillo,Diplomatic Services operational officer,1997
60,"Campos, Reynolds and Mccormick",Diplomatic Services operational officer,1986
79,James and Sons,Diplomatic Services operational officer,1910
98,"Johnston, Fleming and Tanner",Diplomatic Services operational officer,2015
117,Marshall-Holloway,Diplomatic Services operational officer,1920
136,Matthews Inc,Diplomatic Services operational officer,1988
155,Nelson-Li,Diplomatic Services operational officer,1931
174,Nichols-James,Diplomatic Services operational officer,2049
193,Scott Inc,Diplomatic Services operational officer,1966
212,Taylor-Ramos,Diplomatic Services operational officer,2038
231,Thomas-Spencer,Diplomatic Services operational officer,2038
250,"Wallace, Smith and Shepard",Diplomatic Services operational officer,1906
269,"White, Mcclain and Cobb",Diplomatic Services operational officer,1952

### 101. Find the average salary for corresponding to every value of 'Employment_Status'

### 102. Print the index corresponding to the maximum Employee_Salary

### 103. How many unique firstnames exist in the dataset?

### 104. How many unique lastnames exist in the dataset?

### 105. How many unique firstnames exist in the dataset for every company?

### 106. Are there any rows for the employee name 'Michael Edward'? Print True or False

### 107. Check if the substring 'Michael Edward' appears in the Name column or not.

### 108. How many unique Job titles start with the substring 'Pr' (case-sensitive matching)

### 109. How many unique Job titles start with the substring 'Pr' (case-insensitive matching)

### 109. How many records are there whose Country end with the substring 'urt' (case-insensitive matching)

### 110. Print the number of records whose company name contains the substring 'LL' (case-insensitive).

### 111. Select the first row corresponding to every company in the dataframe

### 112. Select the last row corresponding to every company in the dataframe

### 113. Reset the index of the dataframe inplace and delete the older index values.

### 114. Print the type of the DataFrame object.

### 115. Add a new row at the bottom of the DataFrame.

In [ ]:
new_row = ["Chris Anders", "Scott Inc", "Production engineer", "Wardfort", "Anguilla", 343930, "Full Time", 3.3]

### 116. Print the new shape of the DataFrame.

### 117. Add a new column "Employee_Rating_New" which should be as follows:

Employee_Rating_New = max(1.5, 2*Employee_Rating - 3)

### 118. Convert the entire DataFrame to a list of lists. Do NOT overwrite to the current dataframe object.

In [ ]:
df_list = # Your code here

### 119. Convert the 'Name' to upper case and store it back to the same column.

### 120. Rearrange the columns in the below order. Overwrite to the current DataFrame object.

In [ ]:
new_order = ["Name", "Employee_Job_Title", "Company_Name", 
             "Employee_City", "Employee_Country", "Employment_Status", 
             "Employee_Salary", "Employee_Rating", "Employee_Rating_New"]

df = ## Write your code here

### 121. Add a New column of 'First_name' and compute it from the 'Name' column

### 122. Add a New column of 'Last_name' and compute it from the 'Name' column

### 123. Drop the 'Name' column inplace from the DataFrame.

### 124. Rearrange the columns in the below order. Overwrite to the current DataFrame object.

In [ ]:
new_order = ["First_name", "Last_name", "Employee_Job_Title", "Company_Name", 
             "Employee_City", "Employee_Country", "Employment_Status", 
             "Employee_Salary", "Employee_Rating", "Employee_Rating_New"]

df = ## Write your code here

### 125. Compute the cosine similarity between the series 'Employee_Rating' and 'Employee_Rating_New'

### 126. Rename the columns and store to a new DataFrame 'df_renamed':

1. Employee_Rating -> Rating
2. Employee_Country -> Country
3. Employee_Salary -> Salary
4. Employee_Rating_New -> Rating_New
5. Employment_Status -> Employment_type
6. Employment_City -> City

In [ ]:
df_renamed = # Your code here.

### 127. Rename the columns (inplace):

1. Employee_Rating -> Rating
2. Employee_Country -> Country
3. Employee_Salary -> Salary
4. Employee_Rating_New -> Rating_New
5. Employment_Status -> Employment_type
6. Employment_City -> City

### 128. Count the number of NaN values in each column

### 129. Write a function that takes the employee_salary and returns:

1. "High" if the salary is >= 600000
2. "Medium" if the salary is > 300000 and < 600000
3. "Low" otherwise.

Hint: Use the apply() method.

**Store the returned series to a new column 'Salary_category'.**

### 130. Print the count distribution of the 'Salary_category' column.

### 131.  Map every Company_Name to a unique integer value. Name the new column "Company_ID".

For instance, if the data has 5 companies, "Company A" -> 1, "Company B" -> 2, "Company C" -> 3, "Company D" -> 4, "Company E" -> 5.

### 132. Generate one-hot lables for the 'Employment_type' column. You don't have to add this as a column to the DataFrame.

### 133. Print the number of rows where 'City' belongs to the following list of cities.

Use the isin() method.

In [ ]:
city_filter_list = ["New Russellton", "Whiteside", "Kristaburgh"]

row_count = ## Your code here

print(row_count)

### 134. Print the name of the person with the 10th largest salary.

### 135. Print the name of the person with the 10th largest salary. If there are multiple people with the same salary, print all names.

### 136. Print a cross tabulation of Company Name and Employment Type.

### 137. Print the standard deviation of the Salary column.

### 138. Iterates over the DataFrame's first five rows and print the Company Name

Note: You have to write a for loop here explicitly and iterate.

### 139. Select the last row corresponding to every City in the dataframe

### 140. Sort the dataframe on Employee salary column (inplace).

### 141. The task above has distorted the indexing. Reset the index inplace and drop the current index.

### 142. Now check whether the Salary column is monotonically increasing or not.

### 143-145. Print the 25th, 50th and 75th percentile of the Salary column

### 146. Plot a scatter plot between the Salary column and Rating.

### 147. Distribute the Salary column in 10 equal sized bins.

### 148. Convert the Salary column to numpy array

### 149. Convert the Rating column to numpy array

### 150. Compute the cosine similarity between the numpy arrays created in 148 and 149.